on_start = "Добро пожаловать в команду компании <b>Yalfer X</b>!"
on_staff = "<b><i>😉 Давай знакомиться!</i></b>\n\nМы будем показывать фотографии сотрудников и краткую информацию о них, а ты запоминать. В конце проверим твои знания. Начинаем?"
on_office = "<b><i>😉 Готов изучить наш офис?</i></b>\nПеред тобой план офиса, посмотри и запомни его. Как будешь готов - приступим к тестированию!"
on_ready = "⭐ Компания <b><i>Yalfer X</i></b>\n\nМы - самое крупное ООО в сфере дизайна, чем и гордимся! Попав в нашу команду тебе предстоит погрузится в работу над дизайном среди крупных заказчиков! Взгляни на недавние работы наших дизайнеров. Скоро ты тоже будешь заниматься этим!"
on_duties = "<b><i>➡️ Идём дальше, ты - стажёр</i></b>!\n\nДля начала ознакомься с офисом и нашими сотрудниками, а после погружайся в работу... В обязанности входит:\n1. Помощь коллегам;\n2. Подача расходного материала;\n3. Присутсвие на собраниях;\n4. Переадрессация звонков;\n5. Посещение обучающих курсов."

on_admin_panel = "Вы вошли как <b>администратор</b>!"
on_no_admin_panel = "Вы вошли как <b><i>сотрудник-стажёр</i></b>!\n\nБаллов за тестирование на знание команды:\n<b>{step}</b> [теория: <b>{step_teory}/5</b>]!\n\nПрогресс знания офиса:\n<b>{office_step}/5</b> шагов [теория: <b>{step_office}</b>]\n\nБонус: <b>{code}</b>!"

command_on_text_input = "Сперва завершите заполнение анкеты или же отмените его!"

on_add_worker_1 = "<b><i>1️⃣ Шаг первый!</i></b>\n\n Введите <b>имя</b> и <b>фамилию</b> сотрудника через пробел по примеру <b><i>Иван Иванов</i></b>..."
on_add_worker_2 = "<b><i>2️⃣ Шаг второй!</i></b>\n\n Введите <b>возраст</b> сотрудника. В ответ принимается только цифра!"
on_add_worker_3 = "<b><i>3️⃣ Шаг третий!</i></b>\n\n Введите <b>проведённое в компании время</b> сотрудника. Сколько лет работает сотрудник?!"
on_add_worker_4 = "<b><i>4️⃣ Шаг четвёртый!</i></b>\n\n Опишите сотрудника. Сюда может входить его опыт, вклад и прочее!"

on_acquaintance = "Знакомься, это <b><i>{name}</i></b> <b><i>{surname}</i></b>! Он(-а) работает в нашей компании уже <b><i>{years}</i></b>-(ый/ой) год и показывает хорошие результаты!\n\n❗<b><i>{description}</i></b>"
on_acquaintance_testing = "Введи ответ в формате <b><i>Имя Фамилия</i></b>!\n\n❓<b><i>{description}</i></b>"

on_office_testing = "Введи в ответ только цифру правильного варианта!\n\nНа фотографии красной меткой отмечен(-а):\n1. Санузел;\n2. Комната директора;\n3. Комната секретарши;\n4. Зал совещания;\n5. Комната монтажного отдела;\n6. Проект менеджер;\n7. Столовая;\n8. Тех. инспекция;\n9. Архив;\n10. Коворкинг."

on_testing_yes = "<b><i>💚 Да, верно!</i></b>\n\nЭто был(-а) <b><i>{name}</i></b> <b><i>{surname}</i></b>! {footer}"
